{
    "TITLE": "Hallo!",
    "MESSAGE": "Das bin ich, Sebastian Franke.",

    "header.aboutme": "Über mich",
    "header.skills": "Skills",
    "header.portfolio": "Portfolio",
    "header.alt.logo": "Logo von Sebastian Franke's Portfolio",
    "header.alt.burger": "Menü",
    "header.alt.close": "Menü schliessen",

    "footer.legalnotice": "Impressum",
    "footer.privacy": "Datenschutz",
    "footer.alt.github": "Github",
    "footer.alt.contact": "Kontakt",
    "footer.alt.linkedin": "LinkedIn",

    "hero.letstalk": "Lass uns sprechen",
    "hero.scrolldown": "Runter scrollen",

    "aboutme.intro1": "Hi, ich bin Sebastian Franke. Ich mache Code – und zwar den, der nicht nur funktioniert, sondern auch Spaß macht.",
    "aboutme.intro2": "Ob Frontend-Magie oder Backend-Logik: Ich mag es, wenn Dinge Sinn ergeben. Bugs sind für mich nur unfreiwillige Puzzle, und „geht nicht“ gibt's eigentlich nicht. Ich bin Entwickler aus Leidenschaft, immer neugierig und ständig am Optimieren.",
    "aboutme.intro3": "Was mich antreibt? Großartige Projekte, entspanntes Teamwork und Lösungen, die einfach sitzen. Ich nehme meine Arbeit ernst, mich selbst aber nicht zu sehr. 😉",
    "aboutme.location": "Ich lebe derzeit in Berlin, Deutschland, bin aber offen für moderne Arbeitsformen. Remote-Arbeit stellt für mich kein Problem dar - im Gegenteil, sie ermöglicht oft konzentrierteres Arbeiten. Flexibilität gehört für mich zum Berufsbild eines Entwicklers dazu.",
    "aboutme.openminded": "Ich bin sehr offen für neue Technologien und sehe lebenslanges Lernen als selbstverständlichen Teil meines Berufs. Mich motiviert es, mit aktuellen Tools und Frameworks zu arbeiten, neue Trends zu verstehen und meine Kenntnisse gezielt zu vertiefen.",
    "aboutme.problemsolving": "Mein Ansatz zur Problemlösung ist analytisch, kreativ und lösungsorientiert. Ich zerlege komplexe Aufgaben in überschaubare Teilprobleme, betrachte sie aus verschiedenen Perspektiven und entwickle dann strukturiert mögliche Lösungswege. Dabei setze ich auf eine Kombination aus Kreativität, Beharrlichkeit und Teamarbeit. Jede Herausforderung ist für mich auch eine Lernchance - sei es durch neue Erkenntnisse, durch den Austausch im Team oder durch das Finden besonders eleganter Lösungen.",
    
    "skills.myskills": "Kompetenzen",
    "skills.intro1": "Ich verfüge über umfassende Kenntnisse in der Webentwicklung - von der Erstellung statischer Webseiten bis hin zur Umsetzung komplexer, moderner Webanwendungen. Dabei entwickle ich dynamische und responsive Interfaces, die sich flexibel an unterschiedliche Endgeräte anpassen.",
    "skills.intro2": "Ich arbeite routiniert mit REST-APIs und Datenbanken, um interaktive und datengetriebene Anwendungen zu realisieren. Durch die Zusammenarbeit in verschiedenen Projektteams konnte ich meine Fähigkeiten in kollaborativer Entwicklung, Versionskontrolle und strukturiertem Arbeiten kontinuierlich ausbauen.",
    "skills.subheader": "<span class='text-highlight'>Fähigkeit</span> nicht dabei?",
    "skills.subheadertext": "Kontaktiere mich gerne! Mein Ziel ist es, mein Wissen kontinuierlich zu erweitern.",
    "skills.getintouch": "Kontaktieren Sie mich",
    "skills.learnings": "Besonders interessiere ich mich dafür, folgendes zu lernen:",
    "skills.angular": "Angular",
    "skills.api": "REST-API",
    "skills.continuallylearning": "Continually Learning",
    "skills.css": "CSS",
    "skills.supabase": "Supabase",
    "skills.git": "Git",
    "skills.html": "HTML",
    "skills.javascript": "JavaScript",
    "skills.materialdesign": "Material Design",
    "skills.react": "React",
    "skills.scrum": "Scrum",
    "skills.typescript": "TypeScript",
    "skills.figma": "Figma",
    "skills.photoshop": "Photoshop",
    "skills.illustrator": "Illustrator",
    "skills.indesign": "InDesign",
    "skills.lightroom": "Lightroom",
    "skills.shopify": "Shopify"

,
    "skills.vuejs": "Vue.js",
    "skills.wordpress": "WordPress",
    "skills.canva": "Canva",

    "portfolio.intro": "Hier findest du eine Auswahl meiner Arbeiten - interagiere mit den Projekten, um meine Fähigkeiten in Aktion zu sehen.",

    "projects.github": "GitHub",
    "projects.livetest": "Live Test",
    "projects.join": "Join",
    "projects.join.description": "Aufgabenmanager nach dem Vorbild des Kanban-Systems. Erstellen und organisieren Sie Aufgaben mit Hilfe von Drag-and-Drop-Funktionen, weisen Sie Benutzer und Kategorien zu.",
    "projects.elpolloloco": "El Pollo Loco",
    "projects.elpolloloco.description": "Ein einfaches Jump-and-Run-Spiel, das auf einem objektorientierten Ansatz basiert. Hilf José, Münzen und Giftflaschen zu finden, um gegen die Killerhühner zu kämpfen.",
    "projects.pokedex": "Pokédex",
    "projects.pokedex.description": "Eine Webanwendung, die Pokémon-Daten von der PokéAPI abruft. Durchsuchen Sie Pokémon nach Typen, Stufen und Fähigkeiten.",
    "projects.dabubble": "DABubble",
    "projects.dabubble.description": "DABubble ist ein Chat-Tool für Teams, mit dem Kommunikation und Zusammenarbeit an einem Ort stattfinden. Nutzer können Nachrichten austauschen und Kanäle für verschiedene Themen erstellen. So bleibt das ganze Team immer auf dem Laufenden.",

    "feedback.author_max": "Markus Müller",
    "feedback.feedback_max": "Sebastian kombiniert technisches Können mit echter Leidenschaft. Die Umsetzung unseres Web-Projekts verlief dank seiner strukturierten Art und seinem hohen Engagement reibungslos. Kreativ, verlässlich und immer lösungsorientiert – so macht moderne Teamarbeit Spaß!",

    "contact.contact": "Kontakt",
    "contact.title": "Möchtest du ein Problem lösen?",
    "contact.intro": "Dann melde dich bei mir und erzähle, welche Rolle ich übernehmen kann. Mit einem klaren Blick für Nutzerbedürfnisse, strukturierter Umsetzung und einem Gespür für gute Zusammenarbeit bringe ich echten Mehrwert - für dein Team und dein Produkt.",
    "contact.name": "Dein Name",
    "contact.email": "Deine E-Mail-Adresse",
    "contact.message": "Deine Nachricht",
    "contact.privacy": "Ich habe die <a href='privacy'><span class='text-highlight link'>Datenschutzerklärung</span></a> gelesen und stimme der Verarbeitung meiner Daten gemäß dieser zu.",
    "contact.send": "Nachricht senden",
    "contact.error.name": "Dein Name ist erforderlich",
    "contact.error.email": "Deine E-Mail-Adresse ist erforderlich",
    "contact.error.message": "Deine Nachricht ist erforderlich",
    "contact.error.privacy": "Bitte stimme den Datenschutzbestimmungen zu",
    "contact.email.sended": "Vielen Dank für deine Nachricht!",
    "contact.email.failed": "Beim Senden der Nachricht ist ein Fehler aufgetreten. Bitte versuche es noch einmal.",
    "contact.back": "Zurück"
}