{
    "TITLE": "Hello!",
    "MESSAGE": "It's me, Sebastian Franke.",

    "header.aboutme": "About me",
    "header.skills": "Skills",
    "header.portfolio": "Portfolio",
    "header.alt.logo": "Logo of Sebastian Franke's Portfolio",
    "header.alt.burger": "Menu",
    "header.alt.close": "Close menu",
    
    "footer.legalnotice": "Legal Notice",
    "footer.privacy": "Privacy Policy",
    "footer.alt.github": "Github",
    "footer.alt.contact": "Contact",
    "footer.alt.linkedin": "LinkedIn",

    "hero.letstalk": "Let's talk",
    "hero.scrolldown": "Scroll down",

    "aboutme.intro1": "Hi, I'm Sebastian Franke. I write code – the kind that doesn't just work, but actually brings ideas to life.",
    "aboutme.intro2": "Frontend magic or backend logic: I love it when things make sense. To me, bugs are just unintentional puzzles, and 'impossible' isn't really in my vocabulary. I'm a passionate developer, always curious and constantly optimizing.",
    "aboutme.intro3": "What drives me? Great projects, relaxed teamwork, and solutions that just click. I take my work seriously, but myself? Not too much. 😉",
    "aboutme.location": "I currently live in Berlin, Germany, but I'm open to modern ways of working. Remote work is no problem for me - on the contrary, it often allows for more focused work. Flexibility is, in my view, an essential part of being a developer.",
    "aboutme.openminded": "I'm very open to new technologies and consider lifelong learning a natural part of my profession. I'm motivated by working with current tools and frameworks, understanding new trends, and deepening my knowledge in a targeted way.",
    "aboutme.problemsolving": "My approach to problem-solving is analytical, creative, and solution-oriented. I break down complex tasks into manageable subproblems, view them from different perspectives, and then develop structured approaches to solve them. I rely on a mix of creativity, persistence, and collaboration. Every challenge is a learning opportunity for me - whether through new insights, team exchange, or finding particularly elegant solutions.",
        
    "skills.myskills": "My skills",
    "skills.intro1": "I have extensive knowledge in web development - from creating static websites to building complex, modern web applications. I develop dynamic and responsive interfaces that adapt flexibly to different devices.",
    "skills.intro2": "I work confidently with REST APIs and databases to create interactive and data-driven applications. Through collaboration in various project teams, I have continuously improved my skills in collaborative development, version control, and structured workflows.",
    "skills.subheader": "Looking for <span class='text-highlight'>another skill</span>?",
    "skills.subheadertext": "Feel free to get in touch! I'm always looking to expand my knowledge.",
    "skills.getintouch": "Get in touch",
    "skills.learnings": "I have a special interest in learning",
    "skills.angular": "Angular",
    "skills.api": "REST-API",
    "skills.continuallylearning": "Continually Learning",
    "skills.css": "CSS",
    "skills.supabase": "Supabase",
    "skills.git": "Git",
    "skills.html": "HTML",
    "skills.javascript": "JavaScript",
    "skills.materialdesign": "Material Design",
    "skills.react": "React",
    "skills.scrum": "Scrum",
    "skills.typescript": "TypeScript",
    "skills.figma": "Figma",
    "skills.photoshop": "Photoshop",
    "skills.illustrator": "Illustrator",
    "skills.indesign": "InDesign",
    "skills.lightroom": "Lightroom",
    "skills.shopify": "Shopify"

,
    "skills.vuejs": "Vue.js",
    "skills.wordpress": "WordPress",
    "skills.canva": "Canva",

    "portfolio.intro": "Explore a selection of my work here - Interact with projects to see my skills in action.",

    "projects.github": "GitHub",
    "projects.livetest": "Live test",
    "projects.join": "Join",
    "projects.join.description": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
    "projects.elpolloloco": "El Pollo Loco",
    "projects.elpolloloco.description": "A simple Jump-and-Run game based on an object-oriented approach. Help José to find coins and poison bottles to fight against the killer chickens.",
    "projects.pokedex": "Pokédex",
    "projects.pokedex.description": "A web application that retrieves Pokémon data from the PokéAPI. Search Pokémon by types, levels and abilities.",
    "projects.dabubble": "DABubble",
    "projects.dabubble.description": "DABubble is a team chat tool that brings communication and collaboration together in one place. Users can exchange messages and create channels for different topics. This keeps the whole team connected and informed.",

    "feedback.author_max": "Sebastian Franke",
    "feedback.feedback_max": "Working with Sebastian was great in every way. With technical expertise, a lot of initiative, and a clear eye for the essentials, we successfully implemented our web project together. Reliable, committed, and always open to new ideas—that's what makes teamwork fun!",

    "contact.contact": "Contact",
    "contact.title": "Got a problem to solve?",
    "contact.intro": "Let's talk about how I can contribute. I bring structure, clarity, and a collaborative mindset to every team I join - delivering solutions that last and add real value to your product.",
    "contact.name": "Your name",
    "contact.email": "Your email address",
    "contact.message": "Your message",
    "contact.privacy": "I've read the <a href='privacy'><span class='text-highlight link'>privacy policy</span></a> and agree to the processing of my data as outlined.",
    "contact.send": "Send Message",
    "contact.error.name": "Your name is required",
    "contact.error.email": "Your email address is required",
    "contact.error.message": "Your message is required",
    "contact.error.privacy": "Please agree to the privacy policy",
    "contact.email.sended": "Thank you for your message!",
    "contact.email.failed": "An error occurred while sending your message. Please try again.",
    "contact.back": "Back"
}